In [1]:
import pandas as pd
import sqlite3

In [2]:
import os

In [3]:
os.getcwd()

'c:\\Users\\Usuario\\OneDrive\\Documentos\\THE BRIDGE\\TRABAJO\\2-Data_Analysis\\5-Bases_de_datos\\SQL\\Ejercicios\\murder_game'

In [4]:
os.listdir()

['data', 'Ejercicio SQL Murder.pdf', 'sql_murder.ipynb']

In [5]:
conn = sqlite3.connect("data/sql-murder-mystery.db")
cursor = conn.cursor()

In [6]:
def sql_query(query):
    cursor.execute(query)
    data = cursor.fetchall()

    columns = [cosa[0] for cosa in cursor.description]

    return pd.DataFrame(data, columns=columns)

A crime has taken place and the detective needs your help. The detective gave you the crime
scene report, but you somehow lost it. You vaguely remember that the crime was a murder that
occurred sometime on Jan.15, 2018 and that it took place in SQL City. Start by retrieving the
corresponding crime scene report from the police department’s database.

In [7]:
from IPython.display import Markdown

In [8]:
query = """   
SELECT * FROM crime_scene_report
WHERE date = 20180115
AND type = 'murder'
AND city = 'SQL City'
"""

display(Markdown(sql_query(query).loc[0, "description"]))

Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".

In [9]:
query = """    
SELECT * FROM person
WHERE address_street_name = "Northwestern Dr"
ORDER BY address_number DESC
LIMIT 1

"""
sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [10]:
query = """    
SELECT * 

FROM person
JOIN interview
    ON person.id = interview.person_id


WHERE person.address_street_name = "Franklin Ave"
AND person.name LIKE 'Annabel%'

"""
display(Markdown(sql_query(query).iloc[0,-1]))

I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.

In [13]:
query = """    
SELECT * FROM person
INNER JOIN interview
ON person.Id = interview.person_Id

WHERE address_street_name = "Northwestern Dr"
AND person.name = 'Morty Schapiro' 
ORDER BY address_number DESC
LIMIT 10

"""
sql_query(query)

display(Markdown(sql_query(query).iloc[0,-1]))

I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".

In [33]:
query = """    
SELECT *
FROM
person 
INNER JOIN get_fit_now_member
ON person.Id = get_fit_now_member.person_Id
INNER JOIN get_fit_now_check_in
ON get_fit_now_member.Id = get_fit_now_check_in.membership_Id
INNER JOIN drivers_license
ON person.license_Id = drivers_license.Id


WHERE  get_fit_now_check_in.check_in_date = 20180109
AND drivers_license.plate_number LIKE "%H42W%"
AND get_fit_now_member.Id LIKE "48Z%"
AND membership_status = "gold"


"""
sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn,id,person_id,name,membership_start_date,...,check_out_time,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279,48Z55,67318,Jeremy Bowers,20160101,...,1700,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS

In [37]:
query = """    
SELECT *
FROM
person 
INNER JOIN interview
ON person.Id = interview.person_Id

WHERE person.name = "Jeremy Bowers"


"""
sql_query(query)
display(Markdown(sql_query(query).iloc[0,-1]))

I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5" (65") or 5'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.